Revit 2024 API
EnergyAnalysisDetailModel.GetAnalyticalSpaces Method
 The collection of analytical spaces.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public IList<EnergyAnalysisSpace> GetAnalyticalSpaces()
Visual Basic
Public Function GetAnalyticalSpaces As IList(Of EnergyAnalysisSpace)
Visual C++
public:
IList<EnergyAnalysisSpace^>^ GetAnalyticalSpaces()
Return Value
 Returns the analytical spaces after model calculation.
See Also
EnergyAnalysisDetailModel Class
Autodesk.Revit.DB.Analysis Namespace